{"podcast_details": {"podcast_title": "The Gary Neville Podcast", "episode_title": "Neville: Liverpool still not a world class defensive unit despite talent | Carragher: New look Chelsea a 'pretty tasty' proposition", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/3e76a3efd9d090a87adfca0f3cbca4c5.jpg", "episode_transcript": " So welcome everyone to the Gary Neville podcast in the company tonight of course of Jamie Carragher We've just watched Chelsea and Liverpool Draw one each and what conclusions Gary are you drawing? Look, I think for both teams to have this fixture in the first game wouldn't have been ideal I mean if you said to me I came here actually with Manchester United I think in Jose Mourinho's first season It's not a fixture you want to stand for bridge away or if you Chelsea Liverpool obviously at home So I would say for both teams, they probably walk away with a point and happy I think there's an element of both teams that is frantic Lacking a little bit of order but it is early in the season Obviously, they've not finished in the transfer window yet Mauricio Potatino is a new manager and Jurgen Klopp is trying to settle his team down But what still surprises me for Liverpool is that that is the most settled back five in the Premier League I mean, I don't know how many games they played together and yet they still don't look like a World-class group and they are a world-class group individually If you look at them, you wouldn't sort of swap any of them maybe can I say but the other three are outstanding the goalkeepers? Fantastic. So that's still a surprise when I watched Liverpool how many chances they concede But I'd say it was a good game of football with obviously improvements to be made by both teams It is strange Jamie, isn't it that you during the game were talking so much about Liverpool defensively because as Gary says Over both sides the most familiar part of either lineup was the Liverpool defense Defense midfield attack on either side the ones we knew the ones we picked in advance were Liverpool. Yeah, of course, but I mean I'm not trying to defend them as in, you know, I think they should be defending better at times individually I'm looking at certain movements that certain players are playing at times. But when you look at Liverpool's front six What it was sort of three or four years ago You had probably the best defender from the front in Roberto Firmino Salahamani I mean that three was not just about scoring goals. It was to understand the when they pressed and then you had a midfield Three of sorts of Jordan Henderson Firmino and Wijnaldum. That was the main three I think when you think of the Champions League win and the league title, I tell you what that's a front six You'd like to play behind isn't it? You know in terms of being a defender now they weren't asked as many questions They're getting asked a lot more questions So obviously there's gonna be more goals conceded and there's gonna be more mistakes made but I do still feel that they can be better Defensively and look look a tough nut to crack if you like It just feels so easy from one end of the pitch to the other against Liverpool That's been a big problem in the first couple of years on the Jürgen Klopp and the last sort of 12 months on the Klopp and it feels like it's gonna carry on again and with Liverpool now You'd almost feel like they were creating Klopp too If you like, you know The second the second team of Jürgen Klopp over these next two or three years and it feels like they're gonna have to go through A little bit of pain like they did when Jürgen Klopp first came in when games are gonna be 2-2 3-3 end to end they're gonna be the most exciting team to watch but as a Liverpool fan It's not exactly what you want You've just talked about that front six that obviously played and that front three were kept together for a long time But eventually had to be break broken up and obviously Firmino was the was the first one to suffer At what point do you think Jürgen Klopp will look at that back four or five and think right? Okay I need to just alter the dynamic of it You've talked about bringing maybe a more solid Across the back four defender that could play maybe left and right back and be more of a sort of what I'm thinking As Pilaqueta or a Timbers just signed for Arsenal that type of player that provides that almost bit more solidity Do you think that's coming or do you think it's something that he'll just persist with as it is at the moment? Well, I think if Liverpool get a centre-back in the will I think in terms of Gomez and Matip behind those two centre-backs They'll want a little bit more than that But it's what type of defender you're bringing in is it a young player that's to get on the ball bring it out from the back Maybe a left footed one would provide Liverpool with a little bit of balance But I just look at all the defenders now and the real defenders always been Andy Robertson He's been the one that really stars and get after people But he's been running up and down that line for five or six years now, you know, it takes its toll and you know Trent we know is never going to be in the team for his defensive abilities. Van Dyke is not quite the same We'd accept that so I just think in there They're gonna ask questions a little bit more without that protection that you'll need and they just need someone just now and again just to Steady the ship in there and just win the one one v one battles rather than looking to get forward and get on the ball If I was a Chelsea fan Gary and they've had a miserable old time for quite a long time now I'd be walking down the Kings Road now thinking this could be alright. I Agree, I mean I was a little bit worried about them in the first half an hour It was a change of system which came out of the blue We weren't expecting it this morning as we prepared for the game But they grew in the game and I thought what there was and it certainly wasn't there at the end of last season where to be Honest with you. They were well, they were disgraceful at times. I mean they threw the towel in they were persistent They continued to keep going. I thought summed up no better than the two midfield players I thought really struggled in the first half hour Fernandez and Gallagher and in the end you were probably looking at one of Those to be man in the match for Chelsea because they really did grow into the game and start to dominate it and that Liverpool mid three start midfield three started to struggle to get a control of the game So yeah, I think that there's a lot to look forward to what you did see about Chelsea though And Mauricio Pochettino will love this is the frantic nature of mudric of Matson of mud white mad wake if he came on of Jackson they run offside. They're sort of if you like the two quick in what they play. They're not cold in the box They're actually a little bit too emotional They're not composed but he will bring that to them I think in terms of how they work on the training pitch So there's a lot to work with the Chelsea a lot of potential and I think they've got the right coach to turn that Potential into what would be high quality and good performers I think was really interesting looking at Chelsea the set up in midfield because obviously it looks like they're gonna get the caicedo deal Over the line It looks like he's gonna play that Connor Gallagher role and ends open and there's majors play higher up You know when you talk about the prices now holding midfield players, we look at Declan Rice I see though It was probably all started in January with Enzo Fernandez coming in But I mean we give him one of the match I mean that was really good in that number eight position if you like So we're really interested in the dynamic there going forward and when you look at Fernandez and size heroes in midfield pair It's pretty tasty, isn't it? I think the one thing for Chelsea and Peter you asked me the question in the first half I actually think with Tiago Silva I think it's a bit of a necessity for them to play because of the fact that they haven't got Experience through the team and you just need someone sometimes to cover your shoulder and feel like a comfort blanket I know we probably needed that as young players So if you've got Cole will one side and you've got these eyes in the other as an example You you do need those fantastic wing backs and we saw fantastic wing backs for Chelsea today chill well and James But and there is a but they've both gone off in the game first game of the season and that will really destroy Mauricio Pochettino's plans because you're gonna play wing backs They have to be outstanding players with high quality who attack like wingers and defend like fullbacks and they do that So that is a big question mark I think if those two can stay fit and you can have Tiago Silva in the middle of a sort of a young I'm a young pair alongside him and then you put Casedo and Fernandez in there And then you've got some young bright forwards It could be a really exciting season for Chelsea, but those wing backs are crucial And if they lose them the whole thing could fall apart a little bit. Yeah, there'll be some anxiety over that I think they started together just six times in the Premier League last year And of course sadly they both missed the World Cup, which was a shame Let's pick through some of the rest of the weekend action You were both at Burnley on Friday night, and I guess you saw what you expected to see Yes, I mean City weren't at the best But they now can win games in all sorts of different ways obviously we know about their possession High quality, highland is a sensation But set pieces are a huge threat and they were just too strong for Burnley And one of the things that you'd always used to say about if Burnley played Manchester City Particularly going back four or five years was that Burnley would be physically stronger than Manchester City But City would obviously be technically better We've now got to a situation where Manchester City are actually physically better than most teams that they play against and technically better That's a real problem And that's why they won the treble and we saw an example of that on Friday And harsh I guess Jamie to judge Burnley by a game against Manchester City Yeah, I mean people talk about a difficult start, but I think it was one of those where you know you go into it It's a big game. The cameras are there great way for them to start the opening game Of the season and no one expects them to get anything from it for interesting listening to The manager Vincent Cumbery before the game. He was actually talking we will get better each game going forward No, he didn't say that after the game. It was just the actual cohesion of his team He felt was a lot of change when they came up in the championship. They had a few lone players They brought a lot of players in so I think he believes in the you know The way he does things him and Craig Bellamy on the training ground this team will grow and get better week after week But listen any team that comes up from the championship more often than not that in it And a dogfight to stay in the division and they'll be delighted if they can stay up But it'd be really interesting how they do it at some stage in the season if they feel they need to change I maybe go not so much direct and long ball ball change things Maybe drop off team to the really been after Manchester City and really tried to press high and went man for man at the back The car that was actually gonna be my point here is that when I watch Burnley on Friday There's no doubt that they're a good football team. They've got good players, but they were very diminutive as a team I felt sort of midfield and up front and you and you think that what Steve I mean I mentioned it on Friday about what Steve Cooper did and you you've obviously looked at Steve Cooper You work with him a lot and how he changed at Nottingham Forest and sort of if you like I suppose in some ways His values and his principles add to all to during the season to keep Nottingham Forest in the Premier League But you think of barely but how do you see the two goals from a two-set piece? I know that's upset How do Burnley do that with the current makeup of the squad because what I did look at on even the substitutes that came on They've got a young goalkeeper as well I was a little bit more nervous about Burnley coming out of the game and look it's Manchester City its first game There's no panic They could go it out football teams, but if they don't out football teams and they don't outrun teams Which I think is the plan and they find out that you go to say for instance a club next week And you think oh, let's say Crystal Palace away as example anything Okay, this is one we can do well and all of a sudden you get beat by them It could just start to set in a little bit. So early Warning signs there a little bit for me in terms of they have to play their way Impose their styles if they don't I don't think they can change and you've just you know, you've just told me They had a problem last season in terms of defending corners. I think that one of the worst records in the championship Conceited two goals from set pieces against City. It's not so much with the ball I'm talking actually without the ball Do you actually actually just sit off the opposition a little bit and bring them on try and hit them on the counter-attack As you said, they haven't got the place to really go Sean Dice long ball put the ball in the box set pieces But they really went after Manchester City and left themselves as I said 1v1 at the back I mean if they're gonna do against Man City, I think I'm gonna do it against most teams But really interesting how the results go and whether they all the things going forward Okay, let's deal shall we to finish with with the two big scorers of the weekend one of whom were Brighton Against another newly promoted club. We appreciate of course that wasn't a live game you haven't necessarily seen that in the same detail, but The easy supposition to make is that Brighton are flying again and Luton might find it difficult I've realized that is facile, but that's what it looks like Well, listen Brighton a carry-on from where they did last season But I mean to be fair to Luton Brighton did score two very late goals as well So put a real sheen on the on the scoreline But I mean in in Ferguson is the center forward you talk about Brighton bringing players into the club bringing players through the ranks And selling them on for big money now I'm sure he'd be there for another couple years But I think he looks the real deal every time I watch him and also don't forget as a young player Can you imagine the education he's getting from that manager because he looks like a top manager doesn't he? You know when you see the day the team play not necessarily with the greatest players in the world But the way that they play the football they play I think he's almost a manager now where a lot of teams actually stood studying the way Brighton play and trying to almost Implement that into their game and he's still new to the Premier League himself. So I think the laddies got up front I think he's pretty special. I think he's only going to get better with him as his manager And the other big score is Newcastle in a game between the two big aspirants If you like the coming teams Newcastle and Villa, I think we were all surprised by the by the gap by the end Absolutely, but I have to say I thought Newcastle were outstanding I was impressed with Villa for parts of the game as well. That sounds daft when a team's got and beat 5-1 but Isaac looks like a hell of a player and they've got a really good midfield Actually looked at Newcastle last night in that 530 game and you look at these two teams here today And you think actually obviously they've got the Champions League to contend with but they're in a better spot Currently currently as we stand here now than these two teams and these two teams have spent an absolute shared load of money Compared to Newcastle. I think well certainly Chelsea have anyway, so I think that where Newcastle are at they're a powerful team They're all over you like a rash. They're good defensively. They've got power. They've got quality. They've got a great striker And I think they were up against an Aston Villa team It will be an awful lot of teams this year and cause a lot of damage because I thought the RV and Watkins up front looks a real handful at times and I think Newcastle handled them and probably beat Aston Villa as As well as anybody will beat them this season. I don't see Aston Villa losing too many games like that I mean Liverpool is the Newcastle that's Liverpool's next away game And I think you think of the pace and the energy that they play with at st James's Park and if Liverpool perform how they did here if a large part of the game I think they'll find it very difficult to pick any points up at all at st James's Park because I mean, you know Chelsea were good today on the ball But you just think of that extra energy and pace and cohesion that they have at Newcastle right now It's a really tough place to go and Liverpool obviously will have another game in the legs next week against Bournemouth But that that will be a real fight because you think of these two teams and Newcastle Maybe maybe fighting for that last Champions League spot You'd say maybe to get back into a you know, the Champions League for all clubs Okay. Well, I think that has been the first edition this season of the Gary Neville brackets imposter Assistant to the manager Thank You David Brent and The chaps I'm sure will be saving their very best for Monday Night Football 630 Sky Sports Premier League, but for now, thanks for listening"}, "podcast_summary": "In the first three-quarters of the podcast, Gary Neville and Jamie Carragher discuss the Chelsea vs Liverpool draw and analyze the performances and defensive issues of both teams. They also talk about the potential of Chelsea under new manager Maurizio Sarri and the need for defensive reinforcements. They touch on Burnley's performance against Manchester City and discuss the importance of set pieces for both teams. They also briefly mention Brighton's win over Luton and Newcastle's impressive performance against Aston Villa.", "podcast_guest": "Gary Alexander Neville (born 18 February 1975) is an English football pundit and former player. He is also a co-owner of English Football League club Salford City. After retiring from football in 2011, Neville went into punditry and was a commentator for Sky Sports, until he took over the head coach position at Valencia in 2015. After being sacked by the club in 2016, he returned to his position as a pundit for Sky Sports later that year. He was also assistant manager for the England national team from 2012 to 2016.As a player, Neville played as a right-back and spent his entire playing career with Manchester United, making him a one-club man. At the time of his retirement in 2011, he was the second-longest-serving player at the club behind long-time teammate Ryan Giggs, and had served as club captain for five years. He is one of the most decorated English and European footballers of all time, having won a total of 20 trophies, including eight Premier League titles and two Champions League titles.Neville made his international debut in 1995 and was first-choice right-back for England for more than 10 years, representing the nation at three European Championships and two World Cups. He is England's most-capped right-back with 85 caps.\nNeville is the older brother of twin siblings: his brother, Phil Neville was also a former player for Manchester United, later joining Everton, and his sister, Tracey Neville, is a retired netball international.", "podcast_highlights": "Top 3 highlights from the podcast:\n1. The surprise at how the Liverpool defense, considered the most settled back five in the Premier League, still looks shaky and concedes chances.\n2. The discussion around Chelsea's potential for improvement under the management of Maurizio Pochettino and the impact of wing backs on their style of play.\n3. Analysis of Newcastle's impressive performance against Aston Villa, with praise for their powerful and cohesive team, as well as their ability to handle Villa's attacking threats.\n\nFinal highlight delivered at the end of the podcast:\nThe upcoming Liverpool vs. Newcastle game is expected to be a tough challenge for Liverpool due to the energy, pace, and cohesion of Newcastle's play at St. James' Park. Liverpool may find it difficult to pick up points in that fixture, making it an intriguing matchup."}
