{"podcast_details": {"podcast_title": "Ongoing History of New Music", "episode_title": "The Book of World Records Version 1.0 - Part 1", "episode_image": "https://megaphone.imgix.net/podcasts/3df56f68-e283-11ec-85f4-6f2fa9aeccea/image/image.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Hey, it's Alan, and I just wanted to let you know that you can now listen to the ongoing history of new music early and ad-free on Amazon Music, included with Prime. Chances are you have at least some kind of talent. Maybe it's not something very useful, but at least it's something that you can do that no one else can. My mom used to say that everyone is good at something, or at the very least known for something that no one else is. For example, I grew up with a kid who could dislocate his thumbs at will. It was great for freaking out substitute teachers. He got to go home early a lot. Another kid could pop a wheelie on his bike and ride it all the way home like that, and he'd live more than a mile from the school. Sometime in the 1970s, though, the world discovered the Guinness Book of World Records, and that's when we realized that there were things out there much stranger than we could ever realize. Like the dude from India whose fingernails had a combined length of over 20 feet, or Elaine Davidson, the world's most pierced woman. 720 piercings, including dozens in her face. Another dude from Scotland has tattoos over 99.9% of his body, making him the world's most tattooed man. Then in the summer of 2008, Sandy Allen died. She was the world's tallest woman at 7 feet, 7 inches. She lived in the same Indiana nursing home as Edna Parker, who died a year earlier at the age of 115. Up until then, she had been the world's oldest woman. This got me thinking. Has anyone ever put together a list of world records for the world of New Rock? A list of all the superlatives, the biggest, the shortest, the highest, the longest, the most expensive, all those things. I couldn't find one. So I thought to myself, hey, there's a gap in the market. There's got to be enough genuine and morbid curiosity out there to make it worthwhile, and who knows? Maybe a project like this might inspire someone to do something great, or at least something weird, which of course would be good too. Therefore, ladies and gentlemen, I give you the Ongoing History of New Music Book of World Records, version 1.0, part one. This is the Ongoing History of New Music podcast with Alan Cross. Out of Sweden, that's a group called the Wannadies with a song from 1995 called New World Record. And that pretty much sets things up for this show. Hello again, I'm Alan Cross, and this is the first of a two-part program all about superlatives from the world of New Rock. We're talking the biggest, the fastest, the highest, the longest, all those things. It's a musical book of world records. And having spent the last while collecting this information, let me tell you something. This is going to be goofy. Let's warm up with some easy stuff. And again, we're going to confine ourselves to the world of New Rock and alt rock, which is all the stuff that evolved out of the punk rock explosion of the 1970s. How about the longest recorded song? Let's ponder what that means for a moment. We're talking about a single, unbroken piece of music presented as a whole. Back in the day, the maximum length of a song was determined by the medium on which it was stored. In the case of a vinyl album, a song could be no longer than the maximum length of an album side. In 1974, Kraftwerk released an album called Autobahn, and the title track took up all of side one, 22 minutes and 43 seconds. That same year, Mike Oldfield issued Tubator Bells. Its title track was so long that it had to be divided into two. Part one ran 25 minutes and 36 seconds on side one, while part two took up 23 minutes and 20 seconds on side two. Technically, the cassette offered possibilities of even longer songs. A C120 cassette offered a maximum of 60 minutes per side, but I don't know of anyone who actually took up that challenge. The tape used for C120 cassettes was very thin and prone to stretching, which caused distortion. I guess no one really wanted that. But when the CD was introduced in 1982, that was a little bit different. According to legend, the chairman of Sony, one of the developers of the compact disc, decreed that the CD must be able to hold his favorite Beethoven symphony in its entirety, 74 minutes of uninterrupted Ludwig van. The story isn't true, but it is true that the maximum running time of a CD is between 74 and 80 minutes. If you've ever bought a CD, you'll know that a lot of performers often feel the need to fill it up, even if it means a lot of crap. Then we meet Chris Butler. Chris is the guy who wrote this song. Chris wrote that song, Christmas Rapping, for a group called The Waitresses back in 1981. At around the same time, he wrote the theme song for the CBS comedy called Square Pegs, which starred a very young Sarah Jessica Parker. As a slight aside, Chris is from Ohio, where he went to Kent State University, and he was actually in the group of students that was fired upon by the National Guard on May 4th of 1970. You know, a song that inspired this song by Crosby Stills Nation Young? Chris spent much of the 1980s as a record producer and producing a bunch of cable TV shows. By the middle 90s, though, he was back performing as a solo artist. In 1996, he started a project as a joke. It was an album called The Devil Glitch, and it featured just one song, the title track. It stretched out to 68 minutes and 53 seconds, 500 verses, none of which repeated, and there were no instrumental breaks. It took him three months to write it. And get this, Chris recorded his part in one long tape, just him singing and playing the acoustic guitar. He then broke the song down into chunks, ranging from two to five minutes in length, and gave those bits to musician friends who added their own instrumentation and backup vocals. Once they were done, they sent everything back to Chris, who reassembled everything into one long song. Now, before you dismiss this as a gimmick, I should tell you that the song itself is very clever, and that it was nominated for a Grammy Award in 1998. You want to hear it? Or at least some of it? Okay, here we go, a portion of The Devil Glitch by Chris Butler. Chris Butler with five minutes of the 69 minutes The Devil Glitch, certified by the Guinness Book of World Records as the world's longest recorded rock song. And you know what, since we're talking about long things, how about the world's longest song title? That distinction seems to belong to a Swedish band called Rednecks. Ready? Okay. They released a single in 1995 called The Sad But True Story of Ray Mingus, the lumberjack of bulk rock city and his never slacking strive in exploiting the so far undiscovered areas of the intention to bodily intercourse from the opposite species of his kind during intake of all the mental condition that could be derived from fermentation. What's the title? 52 words. What about the longest album title? Well, I guess that depends on your criteria. In terms of the longest title of an album that actually made the charts, the winner is Fiona Apple's second album, which came out in 1999. Its name was inspired by a poem that she wrote after reading a bad review of her music. That album is called When the pawn hits the conflicts, he thinks like a king, what he knows throws the blows. When he goes to the fight and he'll win the whole thing for he enters the ring, there's no body batter when your mind is your might. So when you go solo, you hold your own hand and remember that depth is the greatest heights and if you know where you stand, then you know where to land and if you won't fall, it won't matter because you'll know that you're right. That's long. 90 words. And if you include spaces, 446 characters. It's the one that turns up the most when you do a search. But it is not the longest album title that I have ever heard of. On October the 22nd, 2007, a band from Belgium called Soulwax released a record. Never made any charts, but it was an official release. It's a collection of remixes they did mostly for other people's work. It is called... Ready for this? Here we go. Most of the remixes we've made for other people over the years, except for the one for Einster Zende Noybaden, because we lost it and a few we didn't think sounded good enough or just didn't fit lengthwise. But including some that are hard to find because either people forgot about them or simply because they haven't been released yet, a few we really love and one we think is just okay. Some we did for free, some we did for money, and some we did for ourselves without permission and for some friends as swaps but never on time and always at our studio in Ghent. That's the title. Let's hear something from that record. This is Soulwax and their remix of Dare from Damon Albarn and Gorillaz. That's the Belgian electronic duo called Soulwax with their remix of Dare by Gorillaz. That's included on a compilation of Soulwax remixes called... Do I have to do this again? Okay, there it is. The album is called... Most of the remixes we've made for other people over the years, except for the one for Einster Zende Noybaden, because we lost it and a few we didn't think sounded good enough or just didn't fit lengthwise. But including some that are hard to find because either people forgot about them or simply because they haven't been released yet, a few we really love and one we think is just okay. Some we did for free, some we did for money, and some we did for ourselves without permission and for some friends as swaps, but never on time and always at our studio in Ghent. All right, let's move to the other end of the spectrum. What is the shortest New Rock song ever recorded? Well, I have a couple of candidates. Two come from a goofy hardcore thrash band called Stormtroopers of Death. In 1985, they released an album called Speak English or Die, and it was known for its brevity. Let me play you several selections from Stormtroopers of Death. This is called the Anti-Procrastination Song. Yeah, the Anti-Procrastination Song from Stormtroopers of Death. Runs about four seconds. And just in case you missed it, here it is again. But there's more. From the same album, Speak English or Die is this. It's called The Ballad of Jimi Hendrix. And again. The Ballad of Jimi Hendrix, again about four seconds. And I have one more. This is a track called Diamonds and Rust, and I should point out that this is listed as the extended version of Diamonds and Rust. And once more. Diamonds and Rust, the extended version from Stormtroopers of Death. It's funny, but I've never been able to find the regular version. But lest we think that's as short as we can go, I offer this from the death metal band Napalm Death. The song is called You Suffer. It's from a 1987 album entitled Scum, and appeared on one side of a seven inch single that was given away with the death metal compilation record called Grindcrusher. I shall now play it for you. This is Napalm Death and You Suffer. Thank you. Thank you very much. You Suffer from Napalm Death, clocking in at exactly 1.316 seconds. 1.316 seconds. It's been certified as the shortest rock song ever. Not only has Napalm Death played that song in concert, but it's also available on iTunes for 99 cents. Oh, and that seven inch single I just mentioned? You Suffer was on one side, and the other side featured a track called Mega Armageddon Death Part 3 by a group called Electro Hippies. It runs just a fraction of a second longer. And here it is. Mega Armageddon Death by the Electro Hippies. Together, this split seven inch single from Electro Hippies and Napalm Death runs just shy of three seconds. This is the shortest seven inch single in the history of recorded music. And since we're deep into the ridiculous here, how about the shortest video ever made? Well, that honor belongs to a grindcore band from New York City called Brutal Truth. In 1992, they released an album called Extreme Conditions Demand Extreme Responses. This record contains a song called Collateral Damage. It had an official running time of 2.18 seconds. Yet they decided that, you know what, we should make a video for this. So they did. It features 48 still images followed by a clip of an explosion. Each image gets 44 one thousandths of a second in screen time. Would you like to hear the soundtrack to this video? Of course you would. Here it is. This is Collateral Damage by Brutal Truth. You're welcome. Can we do that again just so everybody can experience it properly? Okay, thanks. More superlatives coming up, including the highest gig ever performed. And I mean high as in altitude in case you're wondering. That's next as the first ever ongoing history of New Music Book of World Records continues. Welcome back. I'm Alan Cross and I can't believe we've never done this before. It's the first ever edition of the ongoing history of New Music Book of World Records. We're running through some of the superlatives, the biggest, the smallest, the longest, the shortest things from the world of New Rock and alternative music. Our next category is the highest gig ever played. And again, we have to be very careful on how we define highest. First of all, we're concerned with actual altitude and not anything to do with chemicals. Second, we have to make the distinction of whether or not the performance is actually connected to the ground. On November 26th, 1997, the British band Spiritualized, a group known for their, uh, highness, played an invitation only show in the Skypod, which is the upper observation deck of the CN Tower in Toronto. And they billed this as the highest show ever. 447 meters above the ground. Okay, that's nice, but it's nothing. A British charity organized a group of amateur musicians on Mount Everest. It was a fundraiser for Nepalese children. The gig, in November 2005, was staged above Everest Base Camp at an altitude of 5,545 meters. And that seems to be the highest gig performed while still touching the ground. But for the highest gig ever, we need an airplane. And the winner in this category seems to be Jamiroquai, the English funk rock dude. He did something for Sony Ericsson, the mobile phone company. They called it the Great Gig in the Sky. Sorry about that, Pink Floyd fans. It took place on February 27th, 2007, on a converted 757 that took off from Munich, Germany. 200 fans came along to see a performance of six songs, all of which were recorded. When the plane landed in Athens, there was a big after party and another performance. And apparently a total of six world records were broken during this flight. Number one, the highest ever concert. Number two, the highest ever recording session. Number three, the fastest concert ever. I guess they mean the speed at which the plane was traveling. Number four, the same thing with fastest recording session ever. Number five, highest ever gig in a plane. Apparently there had been others, including one by the White Stripes, but at an altitude less than 35,000 feet. And finally, number six, fastest gig in a plane, which seems a bit redundant, but a Guinness Book of World Records guy was there, so he gave it to him. This was one of the songs performed on that 757. Appropriately enough, the track is called High Times. Jamiroquai, featuring singer J.K. with High Times. One of the songs performed on his record-breaking highest concert ever event aboard a specially converted 757 on February 27, 2007. Wait, what's that? Oh, hold everything, there's been an appeal to the judges. A Norwegian dude, Evan Johnson, who goes by the name Magnet, claims that he holds the record. He debuted his album, The Simple Life, by performing it on an airplane flying from Oslo to Reykjavik in Iceland at a flying altitude of 40,000 feet. Apparently this didn't work because the album hit number one on the Norwegian charts in its first week in the stores. Do we have a date for this event? Has it been certified by the judges? Not as officially as the Jamiroquai event, huh? Okay, well, I guess we'd better give Magnet some props, just in case. So here's Evan from that 2007 album, The Simple Life. This is called The Gospel Song. Magnet with The Gospel Song from his 2007 album, The Simple Life, he claims to have performed a concert at 40,000 feet whilst flying from Norway to Iceland. The judges are still huddling over that one. Okay, so if we're going to cover the highest gig ever, what about the lowest? The answer seems to be a show by Katie Malua, a British singer who was born in the former Soviet Republic of Georgia and who dated Luke Pritchard of the Cooke's for about three years. On October 1st, 2006, she and her band played a show for some oil rig workers, 303 meters, which is almost a thousand feet below sea level. The show was on the Stay Oils Troll A gas rig. This is submerged under the ocean. Total attendance for the two 30-minute gigs? Twenty. Here's an example of Katie's work. It's her cover of The Cures, Just Like Heaven. Katie Malua with The Cures, Just Like Heaven. She is the world record holder of the world's lowest gig, playing on an oil rig submerged almost 1,000 feet below sea level. I guess you could say that she holds the record for the world's deepest concert too. More superlatives in a moment. Hang on. Welcome back. I'm Alan Cross, and this is the first ever edition of the ongoing history book of world records, a collection of superlatives and sometimes dubious achievements from the world of new rock and alternative music. We have time for one or two more. Check this out. These days, we're lucky if our favorite band releases a new album every two years. In the case of a band like U2, it's something like every four years. But what of people who work the opposite way? Who, for example, holds the record for releasing the greatest number of albums over the shortest period of time? The answer seems to be a British group called Psychic TV. During one 18-month spurt that stretched from 1985 to early 1987, they released 14 albums. It's true that most of these releases were live recordings of sketchy quality, but that's the official world record in the Guinness Book. I'll play you something from their Live in Paris album from 1986, but I'll keep it short because, well, you'll see. There was autumn leaves, start to fall, maybe start to see, everything was pretty. I look at you with your strange affair, see your very black hair, wonder why you're there. The British industrial outfit called Psychic TV with Stranger Affair from their Live in Paris album from 1986. That's part of their record-breaking run of releasing the most albums in the shortest period of time, 14 records in 18 months. Let's finish up the program with something familiar. What is the biggest selling indie album of all time? Think about that for a second. Sales for major label releases are in the tens of millions. ACDC's Back in Black, for example, has sold 45 million copies. Major labels have the clout to market and sell records in territories around the world. Indie labels, though, not so much. Marketing and distribution is a struggle for most, especially on a worldwide level. Selling a million copies of an indie release would be a very, very momentous thing. So I ask again, what album, released on an independent record label, has sold more copies than any other in the history of rock and alternative music? The answer is this one. Released on the Epitaph label on August 23, 1994. It's The Offspring and Smash. The Offspring with Come Out and Play, a single from the biggest selling indie rock record of all time. 120,000 copies in Canada and counting. Six million in the US and counting. And a staggering 18 million worldwide and counting. No other indie rock record has even come close. If we're going to do this world record thing right, we'd better be as comprehensive as we possibly can. So that's why we'll continue things with part two. For example, we need to document the following. The largest drum kit, the most expensive MSRP on a new single, and the world's largest private record collection. We'll start with those and I've got a few more. Part two of the ongoing history of new music book of world records next time, hell comes from Natalia Ribeiro and Adam Morrison. Technical production by Rob Johnston. I'm Alan Cross. You've been listening to the ongoing history of new music podcast with Alan Cross. Subscribe to the podcast through iTunes, Google Play, Stitcher, Spotify, and everywhere you find your favorite podcasts. A portion of this episode is brought to you by Big Brother. Watch the milestone 25th season of Big Brother three nights a week on global. Get ready. Summer is here, which can mean only one thing. This is big. It's the 25th season of Big Brother. Yes, yes, yes. And something big is coming. Yep, Big Brother life is the good stuff. It's game time. It all comes down to this. I'm so freaking excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. I'm so excited. Big Brother all new Wednesdays, Thursdays, and Sundays on global also available on StackTV."}, "podcast_summary": "This episode of the podcast explores superlatives in the world of new rock and alternative music. Alan Cross discusses various records, such as the longest recorded song, the longest song title, the shortest song, the highest and lowest gigs ever performed, the highest number of albums released in a short time, and the biggest-selling indie album of all time. Part two will cover more records, including the largest drum kit, the most expensive single, and the world's largest private record collection.", "podcast_guest": "Alan Cross is a Canadian radio broadcaster and a writer on music. Based in Toronto, Ontario, he is best known nationally and internationally as host of the syndicated radio series The Ongoing History of New Music, The Secret History of Rock, and ExploreMusic. In 2013, he started the Geeks & Beats podcast with BNN's Michael Hainsworth.", "podcast_highlights": "Top 3 highlights/facts from the podcast:\n1. The longest recorded rock song is \"The Devil Glitch\" by Chris Butler, with a running time of 68 minutes and 53 seconds. It was nominated for a Grammy in 1998.\n2. The shortest rock song is \"You Suffer\" by Napalm Death, with a duration of exactly 1.316 seconds. It holds the record for the shortest rock song ever.\n3. The highest gig ever played was by Jamiroquai, who performed on a specially converted 757 airplane at an altitude of 35,000 feet. They broke six world records during the event.\n\nFinal highlight from the podcast:\nThe biggest selling indie album of all time is \"Smash\" by The Offspring, released on the Epitaph label. It has sold over 18 million copies worldwide."}
