{"podcast_details": {"podcast_title": "Up First", "episode_title": "Promise To Maui, Climate Change Backdrop, Emerging Economies Summit", "episode_image": "https://media.npr.org/assets/img/2022/09/23/up-first_tile_npr-network-01_sq-cd1dc7e35846274fc57247cfcb9cd4dddbb2d635.jpg?s=1400&c=66&f=jpg", "episode_transcript": " President Biden makes a promise to Hawaii. For as long as it takes, we're going to be with you. Wildfire survivors say housing must be a priority. I'm Amartinez, that's Michelle Martin, and this is Up First from NPR News. It's been a summer of extremes from wildfires to flooding. What part does climate change play? Plus, the leaders of five emerging economies talk cooperation and competition. Our world has become increasingly complex and fractured as it is increasingly polarized and competing with each other. How will they confront those divisions? Stay with us, we'll give you the news you need to start your day. This message comes from NPR sponsor Organic Valley, a co-op of small organic family farms. Farmer Tyler Webb shares why caring for his land has always been a priority. I'd like to contribute to my community an array of ecosystem services beyond just milk. Building topsoil and holding on to water and supporting wildlife to build that resilience that will support generations to come. Discover Organic Valley Dairy at ov.coop.org. President Biden is making a promise to survivors of one of the deadliest wildfires in U.S. history. For as long as it takes, we're going to be with you. The whole country will be with you. The president traveled to Maui to pledge federal help in rebuilding the historic seaside town of Lahaina. That's where the death toll has now risen to 115. Most of those victims remain unidentified. NPR's Jennifer Ludden is in Maui and she's on the line with us now to tell us more. us. So it's been two weeks since this terrible fire. Where are the survivors now? Well, you know, a lot of them are still squeezing in with family and friends, but now more than 1900 have been placed in hotels or Airbnbs. You know, this is a big tourist destination. There are a lot of those. Amanda Vieira's family of four is in a one bedroom with about three weeks of rent help from the state and she is grateful. But she says because of damage from the fire, you know, cell service has been spotty and just applying for aid online has been incredibly difficult. There's no wifi and stuff. And so I have to like stand at a certain spot in my room to get internet, which is hard. And, you know, we lost two cars, a dirt bike, and you can't get anywhere to get wifi if you don't have a car. You know, Vera just got approved for a FEMA payment. She says it's $5,462 and it is supposed to be for two months housing. But she says the place that she's in now is a lot more than that. And it's not easy finding housing here. It's one of the most expensive markets in the country. There was a housing shortage even before the fire. Vera says her sister-in-law got so frustrated looking for a place she and her kids just left for Washington State. You know, that sounds like a huge challenge. So what are people being told about how long they'll even have this aid? Hawaii's governor has said people will have their housing paid into next spring, but a lot of people I speak with, they just don't seem to trust that including Jeremy Delos Reyes. There's a couple of resorts in this area that they're trying to open in 11 days, 12 days. So now where does those hotel rooms go? Right? Because they need tourism or they think they need tourism here. Reyes was born and raised here and there is some tension around tourism. It's helped drive up the cost of living, though of course it also provides many thousands of jobs. Several people have told me they see so many empty vacation homes right now and they just wish more of those owners would let fire survivors stay in them for a bit. So during President Biden's visit, he and other political leaders repeatedly said that Lahaina should be rebuilt the way that residents want it. Are you hearing from people about that and what are they saying? Very much so. There is a real fear that longtime residents will lose their land here to developers. And you know, this place has cultural significance. It was the site of the capital of the Hawaiian kingdom. And you do see this over and over after extreme weather events. Rebuilding is expensive and people get priced out. And in Lahaina, it was the older, less expensive area that burned. At least two apartments were subsidized housing and last year one of them fought a legal battle against a developer to keep it that way. The governor has said he wants to find some way to ban property sales for a while. Some residents say they've already gotten phone calls from developers wanting to buy their land and community activists have been rallying them, telling them to stay strong and not sell. That's NPR's Jennifer Ludden in Mallory. Jennifer, thank you. Thank you. There is no ignoring this extreme weather events that are disrupting so many lives this summer and in too many cases taking lives. Yeah, listen to this list. Intense wildfires in Hawaii, in Washington state and across Canada, a former hurricane that has walloped Mexico, California, and Nevada and now threatens Oregon and Idaho and a suffocating heat wave across the central and southern U.S. Rebecca Hersher from NPR's climate desk is here to tell us more about this. Good morning, Rebecca. Good morning. Okay, so let's just say it. This isn't just bad luck, is it? No, no, not at all. You know, it's all related to human caused climate change. Climate change does not cause extreme events, right? But really intense fires and hurricanes, it makes them more likely and more common. So as the earth heats up, we increasingly get these years, especially summers where it feels like disaster on disaster on disaster, all of them driven in part by warmer temperatures. So for example, hurricanes, they've always happened. But when the ocean is abnormally hot at the surface, it helps hurricanes grow. We are seeing that right now in both the Pacific, where Hurricane Hillary formed and in the Atlantic, where there are multiple potential storms right now. The same is true for wildfires. Wildfires are an important part of healthy forest ecosystems, but drought and heat can make them burn more widely, make them burn more intensely than in the past. So if it feels like it can't be normal, it's not or it didn't used to be. So is this a preview of our future on a planet that's heating up? You know, in some ways, I think yes, especially in August, you know, it can be a stark reminder of climate change for millions of people in the US this time of year because there is so much extreme weather. But it's not like this year is that exceptional, to be frank, you know, especially if you zoom out and look at the planet as a whole. Last year, there were record breaking hurricanes and wildfires and heat waves. The year before that, same deal the year before that and the year before that. And I say that not to minimize it, but to give the context, you know, the last nine years are the hottest nine years ever recorded on planet Earth. Climate change is just relentlessly wreaking havoc on people everywhere. It's just a matter of when that extreme weather will come for you and arrive in your community. Is it possible to avoid even more catastrophic effects? You know, it is. The big thing is to dramatically reduce greenhouse gas emissions, stop burning oil and gas and coal, transition to wind and solar. Scientists say that we need to reduce greenhouse gas emissions in half by the end of the decade and get all the way to basically zero by 2050. Right now, it is not clear that there's political will to do that. There's an array of fossil fuel and corporate interests that are slowing things down. The other thing to remember, though, is that even though climate change does make the weather more intense, we can lessen the damage by building our homes and our cities and our electrical grids in resilient ways by having emergency plans that keep climate driven weather in mind because it's going to keep happening by preparing and protecting those who are most vulnerable to this weather. You know, I'm thinking about floods like the ones in California this week or the fire in Maui. The weather was related to climate change to varying degrees, but how we prepare for and react to that weather can determine who lives and who dies. That's Rebecca Hersher from NPR's Climate Desk. Rebecca, thanks so much once again. Thanks. What's known as the BRICS group of emerging economies, Brazil, Russia, India, China and South Africa, kicks off its annual summit today in Johannesburg. It's a bloc of nations that is sometimes dismissed for a lot of talk with little substance. But this year, the U.S. and Europe are watching closely because of how polarizing Russia's invasion of Ukraine has been. China's president Xi Jinping will attend in person. Russian President Vladimir Putin will not, but will join virtually to avoid putting South Africa in the awkward position of having to arrest him for war crimes under an international criminal court warrant. We're going to hear more about this from Kate Bartlett in Johannesburg. So why don't you just start us off with the headlines? What are the key issues these leaders will take up? Well, two main things on the agenda this year, namely the possible expansion of the bloc to include more countries. Already, collectively, BRICS accounts for 25% of global GDP and 40% of the world's population. Now, some 40 more countries have expressed interest in joining the bloc. And like the current grouping, they include a politically diverse group with democracies like Argentina and autocracies like Iran. But not all the BRICS members are as keen on expansion as others. Russia is spearheading the push for expansion as because of the war in Ukraine, Russia is increasingly isolated. Another main issue on the agenda will be the bloc's desire to move away from U.S. dollar dominance and to promote more use of its own currencies. Kate, would you say more about whether the group is becoming more relevant? I think so. The sheer number wanting to join shows many global South countries buy what BRICS is selling, an alternative to what they see as a U.S. dominated, unequal global order. Something the summit host and South Africa's president, Cyril Ramaphosa, referred to in an eve of summit addressed to the nation. Let's hear what he had to say. An expanded BRICS will represent a diverse group of nations with different political systems that share a common desire to have a more balanced global order. Our world has become increasingly complex and fractured as it is increasingly polarized and competing with each other. And the Ukraine war will likely be the elephant in the room with Russian Foreign Minister Sergey Lavrov filling in for Putin. Both China and South Africa have officially remained neutral on the war but have each proposed peace plans. But host country South Africa has received a lot of flak for not criticizing the Russian invasion and its perceived bias towards Moscow. But Ramaphosa says it doesn't serve African nations to be drawn into a kind of new Cold War. And before we let you go, I take it that China's President Xi is not just there for the summit, is he? That's right. Possibly most significantly, Chinese President Xi Jinping is also paying an official state visit to South Africa today. It's only his second international trip this year after visiting Russia. China is South Africa's biggest trade partner by far and a significant presence in Africa. But South African officials have stressed there is a trade imbalance that needs addressing. There have also been concerns about how China's own economic downturn might affect trade. That's reporter Kate Bartlett in Johannesburg. Kate, thank you so much. Thank you. And that's Up First for Tuesday, August 22nd. I'm Michelle Martin. And I'm A. Martinez. Up First is produced by Mansi Khurana and Claire Mourashima. Our editors are Ravenna Koenig, Neela Banerjee, Michael Sullivan, Tara Neal, Jan Johnson, and Alice Wolfley. Our director is Lily Kyros. Our technical director is Zach Coleman with engineering support from Carly Strange. Join us again tomorrow. And thanks for waking up with NPR. Your NPR station makes Up First possible each morning. Please support them and support us at donate.npr.org. Up First."}, "podcast_summary": "President Biden promises federal help in rebuilding the historic seaside town of Lahaina in Hawaii, which was devastated by wildfires. Survivors of the fire are struggling to find housing in an already expensive market, and there are concerns that longtime residents may lose their land to developers. Climate change is linked to the increase in extreme weather events such as wildfires and hurricanes. The leaders of the BRICS group of emerging economies, including China and Russia, attend a summit in Johannesburg, where issues of expansion, U.S. dollar dominance, and the war in Ukraine are discussed. China's President Xi Jinping also pays a state visit to South Africa.", "podcast_guest": "Joseph Robinette Biden Jr. ( (listen) BY-dən; born November 20, 1942) is an American politician who is the 46th and current president of the United States. A member of the Democratic Party, he previously served as the 47th vice president from 2009 to 2017 under President Barack Obama and represented Delaware in the United States Senate from 1973 to 2009.\nBorn in Scranton, Pennsylvania, Biden moved with his family to Delaware in 1953. He studied at the University of Delaware before earning his law degree from Syracuse University. He was elected to the New Castle County Council in 1970 and to the U.S. Senate in 1972. As a senator, Biden drafted and led the effort to pass the Violent Crime Control and Law Enforcement Act and the Violence Against Women Act; and oversaw six U.S. Supreme Court confirmation hearings, including the contentious hearings for Robert Bork and Clarence Thomas. Biden ran unsuccessfully for the Democratic presidential nomination in 1988 and 2008. In 2008, Barack Obama chose Biden as his running mate, and Biden was a close counselor to Obama during his two terms as vice president. In the 2020 presidential election, Biden and his running mate, Kamala Harris, defeated incumbents Donald Trump and Mike Pence.\nTaking office at age 78, Biden is the oldest president in U.S. history, the first to have a female vice president, and the first from Delaware. In 2021, he signed a bipartisan infrastructure bill, as well as a $1.9 trillion economic stimulus package in response to the COVID-19 pandemic and subsequent recession. Biden proposed the Build Back Better Act, which failed in Congress, but aspects of which were incorporated into the Inflation Reduction Act that was signed into law in 2022. Biden also signed the bipartisan CHIPS and Science Act, which focused on manufacturing, appointed Ketanji Brown Jackson to the Supreme Court and worked with congressional Republicans to prevent a first ever national default by negotiating a deal to raise the debt ceiling. In foreign policy, Biden restored America's membership in the Paris Agreement. He oversaw the complete withdrawal of U.S. troops from Afghanistan that ended the war in Afghanistan, during which the Afghan government collapsed and the Taliban seized control. Biden has responded to the Russian invasion of Ukraine by imposing sanctions on Russia and authorizing civilian and military aid to Ukraine. In April 2023, he announced his candidacy for the Democratic Party nomination in the 2024 presidential election.\n\n", "podcast_highlights": "The top three highlights or facts from the podcast are:\n1. President Biden promising federal help in rebuilding the historic seaside town of Lahaina in Hawaii, which was devastated by one of the deadliest wildfires in US history.\n2. The impact of extreme weather events, such as intense wildfires, hurricanes, and heatwaves, and how they are exacerbated by climate change.\n3. The annual summit of the BRICS group of emerging economies (Brazil, Russia, India, China, South Africa), and their discussions on expanding the bloc and promoting the use of their own currencies.\n\nThe final highlight delivered at the end of the podcast is that Chinese President Xi Jinping is paying an official state visit to South Africa during the BRICS summit, highlighting China's significant presence in Africa and their trade relationship with South Africa."}
